/*#define DEBUG*/
#define pr_fmt(fmt) "[CPLD] " fmt
#define pr_error(fmt) pr_err("ERROR: " fmt)

#include <linux/module.h>
#include <linux/kernel.h>
#include <linux/init.h>
#include <linux/device.h>
#include <linux/io.h>
#include <linux/gpio.h>
#include <linux/platform_device.h>
#include <linux/spi/spi.h>
#include <linux/spi/spi_gpio.h>
#include <linux/spi/cpld.h>
#include <linux/slab.h>
#include <linux/delay.h>


//0117
//#include <mach/clk.h>
//#include <mach/socinfo.h>

//#include "proc_comm.h"
//#include "clock.h"
//#include "mach-msm/clock-pcom.h"

#define CPLD_BUFSIZ		128

#define INTF_SPI		0
#define INTF_UART		1

#define TMUX_EBI2_OFFSET		0x204
#define EBI2_XMEM_CS0_CFG1_OFFSET	0x10028

struct cpld_driver {
	struct kobject		kobj;
	struct device		*dev;

	void __iomem		*cfg_base;
	void __iomem		*clk_base;
	void __iomem		*reg_base;
	void __iomem		*gpio_base;
	void __iomem		*sdc4_base;

	phys_addr_t		cfg_start;

	struct spi_device	*spi;
	struct spi_message	msg;
	struct spi_transfer	xfer;
	uint8_t			buf[CPLD_BUFSIZ];

	uint8_t			sysfs_buf[CPLD_BUFSIZ];
	int			sysfs_cnt;
	int			cfg_offs;
	int			clk_offs;
	int			gpio_offs;
	uint8_t			reg_addr;

	struct cpld_platform_data *pdata;
};

typedef volatile struct _cpld_reg_ {

	unsigned short tx_buffer1_cs_low;	//0x0
	unsigned short tx_buffer2_cs_low;	//0x2
	unsigned short version1_1;		//0x4
	unsigned short rx_buffer1_cs_low;	//0x6
	unsigned short tx_buffer1_cs_high;	//0x8
	unsigned short tx_buffer2_cs_high;	//0xA
	unsigned short version1_2;		//0xC
	unsigned short rx_buffer1_cs_high;	//0xE

} cpld_reg, *p_cpld_reg;

typedef enum _buf_num_ {
	tx_buffer_1,
	tx_buffer_2,
}enum_buf_num;

typedef struct _cpld_manager_
{
	p_cpld_reg p_cpld_reg;
	enum_buf_num current_tx_buf_num;
}cpld_manager;

cpld_manager g_cpld_manager =  { 0 };
static struct cpld_driver *g_cpld;

#define GPIO_SPI 0
#define EBI2_SPI 1


static void clock_setting(struct cpld_driver *cpld, int enable)
{
	pr_info("%s\n", __func__);
	
	if (cpld) {
		pr_info("CPLD true: call clock_set(%d)\n", enable);
		cpld->pdata->clock_set(enable);

		if(enable) {
			writel(0x01, cpld->sdc4_base);			/* MCI_POWER */
			writel(0x18100, cpld->sdc4_base + 0x04);	/* MCI_CLK */
		} else {
			writel(0x00, cpld->sdc4_base);			/* MCI_POWER */
			writel(0x08000, cpld->sdc4_base + 0x04);	/* MCI_CLK */
		}
	}
	else
	{
		pr_err("%s. Poiner is NULL.\n", __func__);
	}
}

int spi_set_route(int path)
{
	struct cpld_driver *cpld = g_cpld;
//    int gpio = cpld->pdata->intf_select;

